
public class arrayDemo2 {
	public static void main(String[] args) {
		/*
		 * 1. Rectangular Array (직사각형) (각 층의 열은 같다)
		 * 2. Ragged Array (각 층의 열의 길이가 다르다)
		 */
//		1. 선언
//		int[] array[];
//		2. 생성
//		array = new int[3][4];
//		3. 할당
//		array[0][0] = 3; array[0][1] = 4;
		
//		int[] array[];  //선언
//		array = new int[][] {				//[3][4]로 굳이 초기화x
//											{3,4,5,6},
//											{7,8,9,10},
//											{11,12,13,14}
//											};		//생성 및 할당
		
//		int [][] array = {
//									{3,4,5,6},
//									{7,8,9,10},
//									{11,12,13,14}
//								};				//초기화
		
		////////////////////////////////////////////
//		int [][] array;  //선언
//		array = new int[3][];  //행을 생성
//		array[0] = new int[3];	//1열 생성  //00, 01, 02
//		array[1] = new int[5];	//2열 생성  //10, 11, 12, 13, 14
//		array[2] = new int[2];	//3열 생성  //20, 21
//		array[0][0] = 3;		//할당
//		
		//2유형
//		int [][] array;		//선언
//		array = new int[][] {
//											{3, 4, 5},
//											{6, 7, 8, 9, 10},
//											{11, 12}
//										};		//생성 및 할당
//									
		//3유형
		int[][] array = {
								{3, 4, 5},
								{6, 7, 8, 9, 10},
								{11, 12}
								};
		
		}
	}

